In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('iris_edited.csv')

In [5]:
df.head()

     d  d.1    f  f.1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa
2  4.7  3.2  1.3  0.2  setosa
3  4.6  3.1  1.5  0.2  setosa
4  5.0  3.6  1.4  0.2  setosa

In [6]:
df2= df[['f','d','a']]
df2.head()

     f    d       a
0  1.4  5.1  setosa
1  1.4  4.9  setosa
2  1.3  4.7  setosa
3  1.5  4.6  setosa
4  1.4  5.0  setosa

In [7]:
#dataframe target column then rows first

In [11]:
df.loc[0:4][['a','f','d']] # row indexes (mostly numbers: slice) x column

        a    f    d
0  setosa  1.4  5.1
1  setosa  1.4  4.9
2  setosa  1.3  4.7
3  setosa  1.5  4.6
4  setosa  1.4  5.0

In [18]:

x = df.iloc[0:2][0:10] # another way to create a new dataframe without putting the name
x

     d  d.1    f  f.1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [19]:
df.head(2)

     d  d.1    f  f.1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [29]:
# iris = pd.read_csv('iris_edited.csv', header = None,skiprows= 1, names=['a','b','c','d','e']) #skiprow is for deleting the asal header in the csv
# iris.head(2)


# to change column names bljh pakai names mcm atas ORRRR

columns = ['p_len','p_wid','s_len','s_wid','species']
iris = pd.read_csv('iris_edited.csv', header = None,skiprows= 1, names=columns)
iris.head(2)

   p_len  p_wid  s_len  s_wid species
0    5.1    3.5    1.4    0.2  setosa
1    4.9    3.0    1.4    0.2  setosa

In [23]:
iris.shape # header becomes row

(150, 5)